Repository: rafaelhaguiar/farm_control
Catalog: lib/app/shared/i18n/l10n/intl_*.arb
Languages: pt_br

# registerFarmToStart
source: Register a farm to start
pt_br: Cadastre uma fazenda para começar

# selectAFarm
source: Select a farm to start
pt_br: Selecione uma fazenda para começar

# anyFarmFinded
source: No farm linked to its user
pt_br: Nenhuma fazenda vinculada ao seu usuário

source: Try again
pt_br: Tentar novamente

# errorToLoadingFarms
source: Error when carrying farms, try again
pt_br: Erro ao carregar fazendas, tente novamente

# excludeDone
source: Exclusion accomplished
pt_br: Exclusão realizada

# animalManagment
source: Manage animal
pt_br: Gerenciar Animal

# animalExcludeSuccess
source: Animal excluded successfully!
pt_br: Animal excluido com sucesso!

# errorToExclude
source: Error when excluding
pt_br: Erro ao excluir

# errorToExcludeTryAgain
source: Error excluding animal, try again!
pt_br: Erro ao excluir animal, tente novamente!

source: Close
pt_br: Fechar

# updateDone
source: UPDATED
pt_br: Atualização realizada

# updateDoneIfSuccess
source: Update successfully performed!
pt_br: Atualização realizada com sucesso!

# errorToUpdateTryAgain
source: Error update animal, try again!
pt_br: Erro ao atualizar animal, tente novamente!

source: FARM ID:
pt_br: ID da Fazenda:

source: FARM:
pt_br: Fazenda:

source: Change tag
pt_br: Alterar TAG

# tag
source: Current tag:
pt_br: Tag atual:

# tagValidatorErrorMsg
source: The tag needs to have 15 characters and they all need to be numbers
pt_br: A tag precisa ter 15 caracteres e todos eles precisam ser números

source: New Tag
pt_br: Nova TAG

source: Cancel
pt_br: Cancelar

source: Save
pt_br: Salvar

source: Delete tag
pt_br: Deletar TAG

# confirmDelete
source: Do you really want to delete?
pt_br: Deseja realmente deletar?

source: Delete
pt_br: Deletar

source: Register
pt_br: Cadastrar

# registerError
source: Error when registering
pt_br: Erro ao cadastrar

# registerErrorTryAgain
source: An unexpected mistake happened and it was not possible to save
pt_br: Aconteceu um erro inesperado e não foi possivel salvar

# closeAndClean
source: Close and clean the list
pt_br: Fechar e limpar a lista

# registerDone
source: Registration
pt_br: Cadastro realizado

# registerDoneSuccess
source: Successful animals!
pt_br: Animais cadastrados com sucesso!

# tagCantBeRegisteredAgain
source: Tag is already registered in the current list
pt_br: A tag já esta cadastrada na lista atual

# putHereAnimalTag
source: Put the animal tag here
pt_br: Coloque aqui a TAG do animal

source: Insert
pt_br: Inserir

# amountAnimals
source: Animals linked to the farm:
pt_br: Animais vinculados a fazenda:

# errorToLoad
source: Error when loading
pt_br: Erro ao carregar

source: Search Animal
pt_br: Pesquisar Animal

source: Register animal
pt_br: Cadastrar Animal

# searchForTagOrId
source: Search by Tag or Animal ID
pt_br: Pesquisar por tag ou id do Animal

# search
source: To look for
pt_br: Pesquisar

# noAnimalsFinded
source: No animals found
pt_br: Nenhum animal encontrado

# searchError
source: Error when searching, try again
pt_br: Erro ao pesquisar, tente novamente
